// Задача 45:
// Напишите программу, которая будет создавать
// копию заданного массива с помощью поэлементного
// копирования.

// Задача 40:
// Напишите программу, которая принимает на вход три
// числа и проверяет, может ли существовать треугольник с сторонами
// такой длины.
// Теорема о неравенстве треугольника: каждая сторона треугольника
// меньше суммы двух других сторон.


int [] newarray = new Random().Next(1,10);
Console.WriteLine();
foreach (var i in collection)

    

int[] array = new int[5,1,10];
for (int i = 0; i < array.GetLength(0); i++) 
{
    Console.Write($"{array[i, j]} ");
}
        
   
